# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
	# Пример:
	# - [2, 3, 4, 5, 6] => [12, 15, 16];
	# - [2, 3, 5, 6] => [12, 15]
	
lst = [2, 3, 4, 5, 6]
	
lst2 = list(reversed(lst))
	
lst3 = [lst[i] * lst2[i] for i in range(len(lst))]
	
print(lst3[0:len(lst) // 2 + len(lst) % 2])
