import pandas as pd

print('----'*30)
print('Табель учащихся в Московской школе # 2022')

stud_card = {
        'ID': ['01','02','03','04','05'],
        'Имя' : ['Иван','Сергей','Екатерина','Ольга','Андрей'],
        'Фамилия': ['Иванов','Бойко','Литвиненко','Гебельс','Зобнин'],
        'Дата рождения' : ['18.08.2001','05.05.2002','02.04.2000','24.02.2003','09.03.2005'],
        'Успеваемость' : ['Плохист','Троечник','Хорошист','Отличник','Хорошист']
}
    
sc = pd.DataFrame(data = stud_card)

with open('students.csv', 'a', encoding='UTF-8') as cl:
        cl.write(f'{sc}')
        cl.write('\n')
    
print(sc)